#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113501636649]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113501636656]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113501636652]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113501636653]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113501636659]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113501636650]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113402076881]
sakuracloud_disk.k8s_lb_disk[1]: Refreshing state... [id=113501636654]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113501636664]
sakuracloud_disk.k8s_lb_disk[0]: Refreshing state... [id=113501636658]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113501636665]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113501636651]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113501636661]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113501636663]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113501636655]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113501636657]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113501636689]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113501636686]
sakuracloud_server.k8s_lb[1]: Refreshing state... [id=113501636678]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15314]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113501636685]
sakuracloud_server.k8s_lb[0]: Refreshing state... [id=113501636679]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113501636688]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113501636670]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113501636671]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113501636669]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501636657" -> (known after apply)
        name              = "k8s-control-plane-1-dev"
      ~ server_id         = "113501636670" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501636651" -> (known after apply)
        name              = "k8s-control-plane-2-dev"
      ~ server_id         = "113501636669" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501636655" -> (known after apply)
        name              = "k8s-control-plane-3-dev"
      ~ server_id         = "113501636671" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501636658" -> (known after apply)
        name              = "k8s-lb-1-dev"
      ~ server_id         = "113501636679" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501636654" -> (known after apply)
        name              = "k8s-lb-2-dev"
      ~ server_id         = "113501636678" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                = "113501636665" -> (known after apply)
        name              = "k8s-router-1-dev"
      ~ server_id         = "113501636685" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501636664" -> (known after apply)
        name              = "k8s-worker-node-1-dev"
      ~ server_id         = "113501636688" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501636661" -> (known after apply)
        name              = "k8s-worker-node-2-dev"
      ~ server_id         = "113501636686" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501636663" -> (known after apply)
        name              = "k8s-worker-node-3-dev"
      ~ server_id         = "113501636689" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501636657",
        ] -> (known after apply)
        id               = "113501636670"
        name             = "k8s-control-plane-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501636651",
        ] -> (known after apply)
        id               = "113501636669"
        name             = "k8s-control-plane-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501636655",
        ] -> (known after apply)
        id               = "113501636671"
        name             = "k8s-control-plane-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501636658",
        ] -> (known after apply)
        id               = "113501636679"
        name             = "k8s-lb-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501636654",
        ] -> (known after apply)
        id               = "113501636678"
        name             = "k8s-lb-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks            = [
          - "113501636665",
        ] -> (known after apply)
        id               = "113501636685"
        name             = "k8s-router-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501636664",
          - "113501636652",
        ] -> (known after apply)
        id               = "113501636688"
        name             = "k8s-worker-node-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501636661",
          - "113501636659",
        ] -> (known after apply)
        id               = "113501636686"
        name             = "k8s-worker-node-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501636663",
          - "113501636653",
        ] -> (known after apply)
        id               = "113501636689"
        name             = "k8s-worker-node-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 9 to add, 9 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>